app/controllers/agendas_controller.rb

  def index
    @agendas = Agenda.all
---
SELECT * FROM `agendas`

  def show
    @agenda = Agenda.find(params[:id])
---
SELECT * FROM `agendas` WHERE (`agendas`.`id` = 0)

  def edit
    @agenda = Agenda.find(params[:id])
---
SELECT * FROM `agendas` WHERE (`agendas`.`id` = 1)

  def create
    @agenda = Agenda.new(params[:agenda])

    respond_to do |format|
      if @agenda.save
---
INSERT INTO `agendas` (`updated_at`, `title`, `description`, `created_at`) VALUES('2009-12-17 00:20:23', 'December OSCC', 'We created an app!', '2009-12-17 00:20:23')